###############################################################
#  Generated by:      Cadence Innovus 15.28-s017_1
#  OS:                Linux x86_64(Host ID s2424.it.kth.se)
#  Generated on:      Wed Jul  5 17:28:19 2017
#  Design:            sar5
#  Command:           saveDesign -cellview {sar5_OADB sar5 final}
###############################################################
current_design sar5
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {clk}]  -name clk -period 250.000000 -waveform {0.000000 125.000000}
set_propagated_clock  [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -min -pin Q [get_ports {clk}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -min -pin Q [get_ports {clk}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -max -pin Q [get_ports {clk}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -max -pin Q [get_ports {clk}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -min -pin Q [get_ports {comp}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -min -pin Q [get_ports {comp}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -max -pin Q [get_ports {comp}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -max -pin Q [get_ports {comp}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -min -pin Q [get_ports {resetn}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -min -pin Q [get_ports {resetn}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -max -pin Q [get_ports {resetn}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -max -pin Q [get_ports {resetn}]
set_load -pin_load -max  0.25  [get_ports {out[4]}]
set_load -pin_load -min  0.25  [get_ports {out[4]}]
set_load -pin_load -max  0.25  [get_ports {out[3]}]
set_load -pin_load -min  0.25  [get_ports {out[3]}]
set_load -pin_load -max  0.25  [get_ports {out[2]}]
set_load -pin_load -min  0.25  [get_ports {out[2]}]
set_load -pin_load -max  0.25  [get_ports {out[1]}]
set_load -pin_load -min  0.25  [get_ports {out[1]}]
set_load -pin_load -max  0.25  [get_ports {out[0]}]
set_load -pin_load -min  0.25  [get_ports {out[0]}]
set_wire_load_mode enclosed
set_input_delay -add_delay 3 -clock [get_clocks {clk}] [get_ports {resetn}]
set_input_delay -add_delay 3 -clock [get_clocks {clk}] [get_ports {comp}]
set_output_delay -add_delay 4 -clock [get_clocks {clk}] [get_ports {out[4]}]
set_output_delay -add_delay 4 -clock [get_clocks {clk}] [get_ports {out[2]}]
set_output_delay -add_delay 4 -clock [get_clocks {clk}] [get_ports {out[0]}]
set_output_delay -add_delay 4 -clock [get_clocks {clk}] [get_ports {out[3]}]
set_output_delay -add_delay 4 -clock [get_clocks {clk}] [get_ports {out[1]}]
set_clock_uncertainty 0.1 [get_clocks {clk}]
