###############################################################
#  Generated by:      Cadence Innovus 15.28-s017_1
#  OS:                Linux x86_64(Host ID s2424.it.kth.se)
#  Generated on:      Tue Aug 29 16:02:23 2017
#  Design:            cur_dec
#  Command:           saveDesign -cellview {cur_dec_OADB cur_dec final}
###############################################################
current_design cur_dec
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {in[0]}]  -name in[0] -period 250.000000 -waveform {0.000000 125.000000}
set_propagated_clock  [get_clocks {in[0]}]
set_propagated_clock  [get_ports {in[0]}]
set_load -pin_load -max  0.25  [get_ports {out[15]}]
set_load -pin_load -min  0.25  [get_ports {out[15]}]
set_load -pin_load -max  0.25  [get_ports {out[14]}]
set_load -pin_load -min  0.25  [get_ports {out[14]}]
set_load -pin_load -max  0.25  [get_ports {out[13]}]
set_load -pin_load -min  0.25  [get_ports {out[13]}]
set_load -pin_load -max  0.25  [get_ports {out[12]}]
set_load -pin_load -min  0.25  [get_ports {out[12]}]
set_load -pin_load -max  0.25  [get_ports {out[11]}]
set_load -pin_load -min  0.25  [get_ports {out[11]}]
set_load -pin_load -max  0.25  [get_ports {out[10]}]
set_load -pin_load -min  0.25  [get_ports {out[10]}]
set_load -pin_load -max  0.25  [get_ports {out[9]}]
set_load -pin_load -min  0.25  [get_ports {out[9]}]
set_load -pin_load -max  0.25  [get_ports {out[8]}]
set_load -pin_load -min  0.25  [get_ports {out[8]}]
set_load -pin_load -max  0.25  [get_ports {out[7]}]
set_load -pin_load -min  0.25  [get_ports {out[7]}]
set_load -pin_load -max  0.25  [get_ports {out[6]}]
set_load -pin_load -min  0.25  [get_ports {out[6]}]
set_load -pin_load -max  0.25  [get_ports {out[5]}]
set_load -pin_load -min  0.25  [get_ports {out[5]}]
set_load -pin_load -max  0.25  [get_ports {out[4]}]
set_load -pin_load -min  0.25  [get_ports {out[4]}]
set_load -pin_load -max  0.25  [get_ports {out[3]}]
set_load -pin_load -min  0.25  [get_ports {out[3]}]
set_load -pin_load -max  0.25  [get_ports {out[2]}]
set_load -pin_load -min  0.25  [get_ports {out[2]}]
set_load -pin_load -max  0.25  [get_ports {out[1]}]
set_load -pin_load -min  0.25  [get_ports {out[1]}]
set_load -pin_load -max  0.25  [get_ports {out[0]}]
set_load -pin_load -min  0.25  [get_ports {out[0]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -min -pin Q [get_ports {in[3]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -min -pin Q [get_ports {in[3]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -max -pin Q [get_ports {in[3]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -max -pin Q [get_ports {in[3]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -min -pin Q [get_ports {in[2]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -min -pin Q [get_ports {in[2]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -max -pin Q [get_ports {in[2]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -max -pin Q [get_ports {in[2]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -min -pin Q [get_ports {in[1]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -min -pin Q [get_ports {in[1]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -max -pin Q [get_ports {in[1]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -max -pin Q [get_ports {in[1]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -min -pin Q [get_ports {in[0]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -min -pin Q [get_ports {in[0]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -max -pin Q [get_ports {in[0]}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -max -pin Q [get_ports {in[0]}]
set_wire_load_mode enclosed
set_input_delay -add_delay 3 -clock [get_clocks {in[0]}] [get_ports {in[2]}]
set_input_delay -add_delay 3 -clock [get_clocks {in[0]}] [get_ports {in[3]}]
set_input_delay -add_delay 3 -clock [get_clocks {in[0]}] [get_ports {in[1]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[2]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[0]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[15]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[9]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[13]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[7]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[11]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[5]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[3]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[1]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[14]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[8]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[12]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[6]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[10]}]
set_output_delay -add_delay 4 -clock [get_clocks {in[0]}] [get_ports {out[4]}]
set_clock_uncertainty 0.1 [get_clocks {in[0]}]
