###############################################################
#  Generated by:      Cadence Innovus 15.28-s017_1
#  OS:                Linux x86_64(Host ID s2424.it.kth.se)
#  Generated on:      Mon Aug 28 16:33:38 2017
#  Design:            nnspc
#  Command:           saveDesign -cellview {nnspc_OADB nnspc final}
###############################################################
current_design nnspc
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {Clk}]  -name Clk -period 250.000000 -waveform {0.000000 125.000000}
set_propagated_clock  [get_clocks {Clk}]
set_propagated_clock  [get_ports {Clk}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -min -pin Q [get_ports {Cfg_in}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -min -pin Q [get_ports {Cfg_in}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -max -pin Q [get_ports {Cfg_in}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -max -pin Q [get_ports {Cfg_in}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -min -pin Q [get_ports {Clk}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -min -pin Q [get_ports {Clk}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -max -pin Q [get_ports {Clk}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -max -pin Q [get_ports {Clk}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -min -pin Q [get_ports {Resetn}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -min -pin Q [get_ports {Resetn}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -rise -max -pin Q [get_ports {Resetn}]
set_driving_cell -lib_cell NAND2X1 -library ac18_CORELIB_WC -fall -max -pin Q [get_ports {Resetn}]
set_load -pin_load -max  0.25  [get_ports {NSEL[4]}]
set_load -pin_load -min  0.25  [get_ports {NSEL[4]}]
set_load -pin_load -max  0.25  [get_ports {NSEL[3]}]
set_load -pin_load -min  0.25  [get_ports {NSEL[3]}]
set_load -pin_load -max  0.25  [get_ports {NSEL[2]}]
set_load -pin_load -min  0.25  [get_ports {NSEL[2]}]
set_load -pin_load -max  0.25  [get_ports {NSEL[1]}]
set_load -pin_load -min  0.25  [get_ports {NSEL[1]}]
set_load -pin_load -max  0.25  [get_ports {NSEL[0]}]
set_load -pin_load -min  0.25  [get_ports {NSEL[0]}]
set_load -pin_load -max  0.25  [get_ports {DAC[3]}]
set_load -pin_load -min  0.25  [get_ports {DAC[3]}]
set_load -pin_load -max  0.25  [get_ports {DAC[2]}]
set_load -pin_load -min  0.25  [get_ports {DAC[2]}]
set_load -pin_load -max  0.25  [get_ports {DAC[1]}]
set_load -pin_load -min  0.25  [get_ports {DAC[1]}]
set_load -pin_load -max  0.25  [get_ports {DAC[0]}]
set_load -pin_load -min  0.25  [get_ports {DAC[0]}]
set_load -pin_load -max  0.25  [get_ports {RE}]
set_load -pin_load -min  0.25  [get_ports {RE}]
set_wire_load_mode enclosed
set_input_delay -add_delay 3 -clock [get_clocks {Clk}] [get_ports {Resetn}]
set_input_delay -add_delay 3 -clock [get_clocks {Clk}] [get_ports {Cfg_in}]
set_output_delay -add_delay 4 -clock [get_clocks {Clk}] [get_ports {DAC[2]}]
set_output_delay -add_delay 4 -clock [get_clocks {Clk}] [get_ports {RE}]
set_output_delay -add_delay 4 -clock [get_clocks {Clk}] [get_ports {DAC[0]}]
set_output_delay -add_delay 4 -clock [get_clocks {Clk}] [get_ports {NSEL[4]}]
set_output_delay -add_delay 4 -clock [get_clocks {Clk}] [get_ports {NSEL[2]}]
set_output_delay -add_delay 4 -clock [get_clocks {Clk}] [get_ports {NSEL[0]}]
set_output_delay -add_delay 4 -clock [get_clocks {Clk}] [get_ports {DAC[3]}]
set_output_delay -add_delay 4 -clock [get_clocks {Clk}] [get_ports {DAC[1]}]
set_output_delay -add_delay 4 -clock [get_clocks {Clk}] [get_ports {NSEL[3]}]
set_output_delay -add_delay 4 -clock [get_clocks {Clk}] [get_ports {NSEL[1]}]
set_clock_uncertainty 0.1 [get_clocks {Clk}]
